app/controllers/users_controller.rb

  def show#the name of our show webpage
    @user = User.find(params[:id])#used params to retrieve the user id.
	#the appropriate request to the Users controller, params[:id] with be the user id, so the effect is the same as the find method.... User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(params[:user])#instance variable = new params users that was incremented

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)